/*
游戏场景图片从0到50
人物图片从50到100
things从100到200
。。。



*/

//else前缀为新线程
//bq前缀为goto
//PIC前缀为图片ID
//SOD前缀为音乐ID
//BTN前缀为按钮
//FT前缀为字体ID
//BRH前缀为刷子ID
//HRO前缀为英雄
//CLSCR清屏颜色
//sw前缀为开关

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//ifon参考

	/*bool IfOn(hero *H)
	{
		if((H->x)<(ni+1)*50&&ni*50<(H->x+H->w)&&H->y<(nj+1)*50&&(H->y+H->h)>nj*50){return true;}
		return false;
	}*/

//信息输出参考

/*wchar_t wmm[200];
swprintf(wmm,sizeof(wmm),L"%d",g_tNow-g_tPre);
PicEdit::GetInstance()->TextL(0,20,wmm,20,FT_WRYH,COLOR(255,255,255,1));*/



//next:

/*
trap类增添
map21移除
\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\地图类提供anm（移动物体，主被动），//开关
挤压判定，随动判定

五关，剧情关卡设计
GUI，关卡选择界面，设置界面------------Doing
下雨，光影特效
后期处理，素材优化
*/